[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://m.media-amazon.com/images/I/51IXWZzlgSL._SY445_SX342_.jpg",
        "review": "To Kill a Mockingbird offers a profound look into the complexities of racial injustice in the American South through the innocent eyes of Scout Finch. Harper Lee masterfully depicts the moral growth and awakening of a small community to the evils of racism and prejudice. Atticus Finch, Scout’s father, serves as a moral beacon, defending a Black man falsely accused of a crime, illustrating the ideals of justice and empathy. This novel remains a timeless exploration of the human condition, capturing the essence of empathy, the fight against injustice, and the loss of innocence.",
        "totalPages": 324,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Classic", "Social Commentary"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://m.media-amazon.com/images/I/41L+OrmfZML._SY445_SX342_.jpg",
        "review": "George Orwell's 1984 is a chilling dystopian novel that explores the perils of totalitarian government, constant surveillance, and the destruction of individual thought. Set in a world of perpetual war, public manipulation, and omnipresent government surveillance, it follows Winston Smith, a low-ranking member of the ruling Party in London. Orwell crafts a haunting narrative that delves deep into the psyche of a man in search of truth and freedom within a society where these ideals are crushed. 1984 is not only a critique of what Orwell saw in his time but a warning about the use of power to control truth and reality.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Dystopian", "Political"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://m.media-amazon.com/images/I/71zNHngqfPL._SL1500_.jpg",
        "review": "The Great Gatsby, F. Scott Fitzgerald's masterpiece, encapsulates the decadence, idealism, and excess of the Jazz Age. Through the eyes of Nick Carraway, we are introduced to the mysterious Jay Gatsby and his quixotic passion for the beautiful Daisy Buchanan. Fitzgerald's novel is a critical social commentary on the American Dream, exploring themes of wealth, class, and the elusive nature of happiness. The narrative’s poetic brilliance and its exploration of the American psyche make it one of the greatest novels of the 20th century.",
        "totalPages": 180,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["Classic", "Romance"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://m.media-amazon.com/images/I/51PQZU1w9kL._SY445_SX342_.jpg",
        "review": "Pride and Prejudice, Jane Austen's most beloved work, is a witty and insightful study of early 19th-century English society and its marital machinations. Following the spirited Elizabeth Bennet and her family, the novel explores themes of love, class, and reputation, as Elizabeth navigates her feelings for the haughty Mr. Darcy. Austen's sharp wit and keen observations of societal norms make this romantic comedy not just a tale of personal growth and love but also a critique of the class-consciousness of her time..",
        "totalPages": 279,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Romance", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://m.media-amazon.com/images/I/71NpZx6bmtL._SL1500_.jpg",
        "review": "Paulo Coelho's The Alchemist is a symbolic masterpiece, telling the story of Santiago, an Andalusian shepherd boy who dreams of discovering a worldly treasure located somewhere beyond the Egyptian pyramids. Coelho weaves a tale that is both a simple adventure and a profound philosophical meditation on finding one's own path in life, listening to our hearts, recognizing opportunity, and following our dreams. It's a motivational story that encourages readers to pursue their life's ambitions while remaining true to themselves.",
        "totalPages": 208,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 6,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://m.media-amazon.com/images/I/61cP8-CI40L._SL1500_.jpg",
        "review": "J.R.R. Tolkien's The Lord of the Rings is an epic tale of friendship, war, and the struggle against the tyranny of evil. Set in the mythical world of Middle-earth, it follows the journey of Frodo Baggins, a humble hobbit, who is tasked with destroying a powerful ring sought by the dark lord Sauron. Alongside a cast of diverse characters, Frodo embarks on a perilous quest that tests the spirit and courage of all involved. Tolkien’s work is a monumental fantasy saga, exploring themes of power, sacrifice, and the ongoing battle between good and evil.",
        "totalPages": 1178,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Epic Fantasy", "Adventure"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 7,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://m.media-amazon.com/images/I/71UZKQ3-wCL._SL1500_.jpg",
        "review": "The Hobbit, J.R.R. Tolkien's prelude to The Lord of the Rings, chronicles the adventure of Bilbo Baggins, a hobbit who is thrust into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo discovers his own depth of courage and ingenuity. Tolkien's richly imagined world, filled with vivid landscapes and a unique cast of characters, makes The Hobbit not only a tale of adventure but also a meditation on bravery, greed, and the discovery of one’s true self",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Adventure", "Children's Literature"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 8,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://m.media-amazon.com/images/I/51xJbFMRsxL.jpg",
        "review": "Harry Potter and the Philosopher's Stone introduces readers to the magical world of Harry Potter, an orphan who discovers on his eleventh birthday that he is a wizard. J.K. Rowling crafts a magical universe filled with wonder, danger, and the power of friendship. As Harry navigates his first year at Hogwarts School of Witchcraft and Wizardry, he learns about his past and faces challenges that test his bravery, integrity, and loyalty. This book lays the foundation for what becomes an epic battle between good and evil, making it a cornerstone of modern children's literature.",
        "totalPages": 309,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 9,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://m.media-amazon.com/images/I/51Y4D0tApUL.jpg",
        "review": "Dan Brown's The Da Vinci Code is a fast-paced thriller that combines art history, cryptology, and religious conspiracy theories into a riveting narrative. Following symbologist Robert Langdon and cryptologist Sophie Neveu as they attempt to solve a murder in the Louvre Museum, the story takes readers on a thrilling chase through historical sites, uncovering secret societies and hidden codes. Brown's novel is a provocative exploration of the sacred and the profane, faith, and what history has come to accept as truth.",
        "totalPages": 597,
        "rating": 4.0,
        "category": "Thriller",
        "tags": ["Mystery", "Conspiracy"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    }
]
